import unittest

import pandas as pd
import prediction_sigma

def test_data():
    """Тестовые данные (нестационарный ряд)"""
    data = {"PAY": [100, 200, 300, 400, 500, 100, 200,
                    100, 200, 300, 400, 500, 100, 200,
                    100, 200, 300, 400, 500, 100, 200,
                    100, 200, 300, 400, 1000, 100, 200,
                    100, 200, 300, 400, 500, 100, 200,
                    100, 200, 1200, 400, 500, 100, 200],
            "PAY_DATE": ["2021-01-01", "2021-01-02", "2021-01-03",
                         "2021-01-04", "2021-01-05", "2021-01-06", "2021-01-07",
                         "2021-01-08", "2021-01-09", "2021-01-10",
                         "2021-01-11", "2021-01-12", "2021-01-13", "2021-01-14",
                         "2021-01-15", "2021-01-16", "2021-01-17",
                         "2021-01-18", "2021-01-19", "2021-01-20", "2021-01-21",
                         "2021-01-22", "2021-01-23", "2021-01-24",
                         "2021-01-25", "2021-01-26", "2021-01-27", "2021-01-28",
                         "2021-01-29", "2021-01-30", "2021-01-31",
                         "2021-02-01", "2021-02-02", "2021-02-03", "2021-02-04",
                         "2021-02-05", "2021-02-06", "2021-02-07",
                         "2021-02-08", "2021-02-09", "2021-02-10", "2021-02-11"]}
    data_frame = pd.DataFrame(data)
    return data_frame


class MyTestCase(unittest.TestCase):
    def test_most_payment_day_of_week(self):
        """Проверка на корректный вывод фунции подсчета самых высооплачиваемых дней недели"""
        most_payment_day_of_week = prediction_sigma.most_payment_day_of_week(test_data())
        self.assertEqual(most_payment_day_of_week[1], 1)
        self.assertEqual(most_payment_day_of_week[6], 1)


if __name__ == '__main__':
    unittest.main()
